[
  {
    "name": "Apple",
    "description": "An apple is an edible fruit produced by an apple tree (Malus domestica). Apple trees are cultivated worldwide and are the most widely grown species in the genus Malus. The tree originated in Central Asia, where its wild ancestor, Malus sieversii, is still found today. Apples have been grown for thousands of years in Asia and Europe and were brought to North America by European colonists. Apples have religious and mythological significance in many cultures, including Norse, Greek, and European Christian tradition. Apple trees are large if grown from seed. Generally, apple cultivars are propagated by grafting onto rootstocks, which control the size of the resulting tree. There are more than 7,500 known cultivars of apples, resulting in a range of desired characteristics. Different cultivars are bred for various tastes and use, including cooking, eating raw and cider production. Trees and fruit are prone to a number of fungal, bacterial and pest problems, which can be controlled by a number of organic and non-organic means. In 2010, the fruit's genome was sequenced as part of research on disease control and selective breeding in apple production. Worldwide production of apples in 2018 was 86 million tonnes, with China accounting for nearly half of the total.",
    "additionalInformation": "Nutritional value per 100g\nEnergy: 218 kJ (52 kcal)\nCarbohydrates: 13.81g\nSugars: 10.39g\nDietary fiber: 2.4 g\nFat: 0.17 g\nProtein: 0.26 g"
  },
  {
    "name": "Avocado",
    "description": "Ripe, soft fruit. Avoid fruit with dark sunken spots or bruises. Colour and texture depend on variety.",
    "additionalInformation": "A serving of 1/5 of a medium Haas avocado has 50 calories and 4.5g of fat. The good news is that most of the fat is monounsaturated and polyunsaturated fat, which are both healthy fats.\nAvocados provide a source of fibre and folate."
  },
  {
    "name": "Blackberries",
    "description": "Blackberries are available in July and August, though you will see imported varieties in supermarkets most of the year.",
    "additionalInformation": "Blackberries provide an excellent source of fibre and a good source of Vitamin C."
  },
  {
    "name": "Cherimoya",
    "description": "Cherimoyas will ripen at room temperature for a few days until softened. They can then be tightly wrapped and refrigerated for up to 4 days.",
    "additionalInformation": "Very high in Vitamin C (60% Recommended Daily Intake per serving)\nVery high in Vitamin B6 (37% Recommended Daily Intake per serving)\nHigh in magnesium (20% Recommended Daily Intake per serving)\nSource of manganese (13% Recommended Daily Intake per serving)\nSource of copper (11% Recommended Daily Intake per serving)\nSource of iron (7% Recommended Daily Intake per serving)\nSource of phosphorus (7% Recommended Daily Intake per serving)\nSource of zinc (6% Recommended Daily Intake per serving)"
  },
  {
    "name": "Cranberries",
    "description": "Cranberries are very versatile. They can be used in sauces, muffins, salads and desserts",
    "additionalInformation": "Nutritional value per 100g\nEnergy: 218 kJ (52 kcal)\nCarbohydrates: 13.81g\nSugars: 10.39g\nDietary fiber: 2.4 g\nFat: 0.17 g\nProtein: 0.26 g"
  },
  {
    "name": "Elderberries",
    "description": "Best are firm berries with a deep colour. Avoid decaying, mushy or bruised fruits.",
    "additionalInformation": "1 serving = 77 g (125 ml)\n\nHigh in Vitamin C (46% Recommended Daily Intake per serving)\nSource of Vitamin B6 (10% Recommended Daily Intake per serving)\nSource of iron (9% Recommended Daily Intake per serving)\nSource of potassium (214 mg per serving)\nHigh in fibre (5 g per serving)\nFat-free (0.4 g per serving)\n"
  },
  {
    "name": "Feijoa",
    "description": "Ripe feijoas normally last about 3 to 5 days. Feijoas peeled and cooked into a puree and frozen.",
    "additionalInformation": "1 serving = 100 g (2 fruits)\n\nHigh in Vitamin C (34% Recommended Daily Intake per serving)\nSodium-free (3 mg per serving)"
  },
  {
    "name": "Grapefruit",
    "description": "Keep at cool room temperature for up to one week or refrigerate for up to one month.",
    "images": ["https://picsum.photos/seed/gf1/150", "https://picsum.photos/seed/gf2/150", "https://picsum.photos/seed/gf3/150"]
  },
  {
    "name": "Kumquat",
    "description": "Kumquats will keep for a few days at room temperature. You can refrigerate them in a plastic bag for up to a month.",
    "images": ["https://picsum.photos/seed/kq1/150", "https://picsum.photos/seed/kq2/150", "https://picsum.photos/seed/kq3/150"]
  }
]